meme_ya_later/app/views/categories/show.html.erb

<h1><%=@category.name%></h1>
<%@category.memes.each do |meme|%>
---
SELECT "memes".* FROM "memes" WHERE "memes"."category_id" = ?  [["category_id", 1]]