meme_ya_later/app/controllers/memes_controller.rb

  def index
    @memes = Meme.all
---
SELECT "memes".* FROM "memes" ORDER BY "memes"."created_at" DESC

  def show
    @meme = Meme.find(params[:id])
---
SELECT "memes".* FROM "memes" WHERE "memes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create

    @meme = Meme.new(meme_params)
    @meme.user_id = session[:user_id]

    if @meme.save
---
INSERT INTO "memes" ("url", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @meme = Meme.find(params[:id])
    @meme.delete
---
SELECT "memes".* FROM "memes" WHERE "memes"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
DELETE FROM "memes" WHERE "memes"."id" = ?  [["id", 17]]