meme_ya_later/app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "sender_id", "receiver_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Hey!"], ["sender_id", 14], ["receiver_id", 13], ["created_at", "2020-11-12 15:51:58.851158"], ["updated_at", "2020-11-12 15:51:58.851158"]]
---
  def create
    @message = current_user.sent_messages.new(message_params)
    @message.receiver_id = @receiver.id
    @message.save

DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 9]]
---
  def destroy
    @message = current_user.received_messages.destroy(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def set_receiver
    @receiver = User.find(params[:username])