meme_ya_later/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "username", "email_address", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Jacob Kagon"], ["updated_at", "2020-11-11 17:13:15.850315"], ["id", 14]]