meme_ya_later/app/views/messages/new.html.erb

<%= form_for @message do |f| %>
    <%= f.collection_select :receiver_id, User.all, :id, :name %><br>
---
SELECT "users".* FROM "users"