meme_ya_later/app/views/memes/_meme_categories.html.erb

    </div>
       <%Category.all.each do |category|%>
---
SELECT "categories".* FROM "categories"