meme_ya_later/app/views/memes/new.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id %><br>
    <%= f.collection_select(:category_id, Category.all, :id, :name) %><br>