meme_ya_later/app/views/users/show.html.erb


<% @user.memes.each do |meme| %>
---
SELECT "memes".* FROM "memes" WHERE "memes"."user_id" = ?  [["user_id", 9]]